package com.test.yangsong;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

/**
 * Created by zhangfan on 15/12/28.
 */
public class Goods {


    public static void main(String[] args) {
        System.out.println(getGoodsTypeNo("纸"));
    }

    private static Map<String, String> maps = new HashMap<String, String>();

    public static String getGoodsTypeNo(String GoodsName) {
        String mgr = null;
        maps.put("720100", "纸浆");
        maps.put("720200", "纸、纸板");
        maps.put("720300", "报纸、书籍、杂志等其他印刷品");
        maps.put("720400", "纸");
        maps.put("810120", "桶装液态医药原料");
        maps.put("810160", "玻璃瓶装医药原料00");
        Set<String> set = maps.keySet();
        double proportion = 0.00;
        for (String key : set) {
            String values = maps.get(key);

            double temp = getProportion(GoodsName, values);
            if(proportion < temp){
                mgr = key;
            }


        }
        return mgr;
        // 木、木浆及木制品；纸、纸浆、纸板及其制品〉其他纸制品 720400
        // 医药类〉桶装液态医药原料 810120
        // 医药类〉玻璃瓶装医药原料 810160
        // 医药类〉疫苗 810200
        // 医药类〉抗血清及其他血制品 810300
        // 医药类〉急救药包、药箱等医药用品 810400
        // 医药类〉片剂西药 820100
        // 医药类〉针剂西药 820200
        // 医药类〉其他西药 820300
        // 医药类〉片剂中成药 830100
        // 医药类〉针剂中成药 830200
        // 医药类〉其他中成药 830300
        // 医药类〉普通中药材 840100
        // 医药类〉高级中药材 840200
        // 医药类〉玻璃瓶装中药汤剂 840360
        // 医药类〉非玻璃瓶装中药汤剂 840370
        // 动、植物及产品〉牛 110102
        // 动、植物及产品〉羊 110202
        // 动、植物及产品〉其他牲畜 110302
        // 动、植物及产品〉走兽 110402
        // 动、植物及产品〉家禽、飞禽 110502
        // 动、植物及产品〉鱼、虾、甲壳动物、软体动物及其他水生无脊椎动物 110602
        // 动、植物及产品〉海豚等海洋动物 110702
        // 动、植物及产品〉其他动物 110802
        // 动、植物及产品〉冷藏、冷冻的肉及食用杂碎制品 120140
        // 动、植物及产品〉非冷藏、冷冻的肉及食用杂碎制品 120150
        // 动、植物及产品〉冷藏、冷冻的鱼、虾、甲壳动物、软体动物及其他水生无脊椎动物制品 120240
        // 动、植物及产品〉非冷藏、冷冻的鱼、虾、甲壳动物、软体动物及其他水生无脊椎动物制品 120250
        // 动、植物及产品〉鲜乳液、蛋、天然蜂蜜 120300
        // 动、植物及产品〉毛皮、皮张、皮革 120400
        // 动、植物及产品〉动物的骨、角、蹄、甲、壳 120500
        // 动、植物及产品〉鬃、马尾 120600
        // 动、植物及产品〉羽毛、绒毛、人造毛、毛条、羽绒 120700
        // 动、植物及产品〉其他动物产品 129900
        // 动、植物及产品〉活树及其他活植物 130100
        // 动、植物及产品〉鳞茎、根及类似品 130200
        // 动、植物及产品〉稻草、秸秆、编结用植物材料 130300
        // 动、植物及产品〉工业用或药用植物 130400
        // 动、植物及产品〉虫胶、树胶、树脂及其他植物液、汁 130600
        // 动、植物及产品〉含油子仁及果实；杂项子仁及果实 130700
        // 动、植物及产品〉盆栽花卉、盆栽类植物、盆景 130802
        // 动、植物及产品〉其他植物产品 139900
        // 动、植物及产品〉散装食用植物油 140111
        // 动、植物及产品〉桶装食用植物油 140121
        // 动、植物及产品〉散装非食用植物油 140210
        // 动、植物及产品〉桶装非食用植物油 140220
        // 动、植物及产品〉食用油脂 140300
        // 动、植物及产品〉动、植物蜡 140400
        // 粮食、食品、果蔬、饮料、烟草及饲料〉散装豆类 210111
        // 粮食、食品、果蔬、饮料、烟草及饲料〉袋装豆类 210121
        // 粮食、食品、果蔬、饮料、烟草及饲料〉集装箱运输的豆类 210131
        // 粮食、食品、果蔬、饮料、烟草及饲料〉散装玉米 210211
        // 粮食、食品、果蔬、饮料、烟草及饲料〉袋装玉米 210221
        // 粮食、食品、果蔬、饮料、烟草及饲料〉集装箱运输的玉米 210231
        // 粮食、食品、果蔬、饮料、烟草及饲料〉散装大米 210311
        // 粮食、食品、果蔬、饮料、烟草及饲料〉袋装大米 210321

    }


    public static double getProportion(String param, String original) {

        double i = original.indexOf(param);
        double j = original.length();

        return i / j;

    }
}
